12/data/attachments/a47418ad779b8bc4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cd858865-2cf8-4dd2-bca7-fd02ca950a17</nif:username>
            <nif:friendToBeAdded>Devin_rather_Friend_94797_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>